# Третє завдання (не обов'язкове)
# У вашій компанії ведеться активна маркетингова кампанія за допомогою SMS-розсилок. 
# Для цього ви збираєте телефонні номери клієнтів із бази даних, але часто стикаєтеся з тим, 
# що номери записані у різних форматах. Наприклад:

# "    +38(050)123-32-34"
# "     0503451234"
# "(050)8889900"
# "38050-111-22-22"
# "38050 111 22 11   "

# Ваш сервіс розсилок може ефективно відправляти повідомлення лише тоді, коли номери телефонів представлені у коректному форматі. 
# Тому вам необхідна функція, яка автоматично нормалізує номери телефонів до потрібного формату, видаляючи всі зайві символи та додаючи міжнародний 
# код країни, якщо потрібно.

# Розробіть функцію normalize_phone(phone_number), що нормалізує телефонні номери до стандартного формату, залишаючи тільки цифри та символ '+' на початку. Функція приймає один аргумент - рядок з телефонним номером у будь-якому форматі та перетворює його на стандартний формат, залишаючи тільки цифри та символ '+'. Якщо номер не містить міжнародного коду, 
# функція автоматично додає код '+38' (для України). Це гарантує, що всі номери будуть придатними для відправлення SMS.

#  Вимоги до завдання:
# Параметр функції phone_number - це рядок з телефонним номером у різноманітних форматах.
# Функція видаляє всі символи, крім цифр та символу '+'.
# Якщо міжнародний код відсутній, функція додає код '+38'. Це враховує випадки, коли номер починається з '380' (додається лише '+') та коли номер починається без коду (додається '+38').
# Функція повертає нормалізований телефонний номер у вигляді рядка.

# Рекомендації для виконання:
# Використовуйте модуль re для регулярних виразів для видалення непотрібних символів.
# Перевірте, чи номер починається з '+', і виправте префікс згідно з вказівками.
# Видаліть всі символи, крім цифр та '+', з номера телефону.
# На забувайте повертати нормалізований номер телефону з функції.

# Критерії оцінювання:
# Коректність роботи функції: функція має правильно обробляти різні формати номерів, враховуючи наявність або відсутність міжнародного коду.
# Читабельність коду: код має бути чистим, добре організованим і добре документованим.
# Правильне використання регулярних виразів для видалення зайвих символів та форматування номера.

import re

raw_numbers = [
    "067\\t123 4567",
    "(095) 234-5678\\n",
    "+380 44 123 4567",
    "380501234567",
    "    +38(050)123-32-34",
    "     0503451234",
    "(050)8889900",
    "38050-111-22-22",
    "38050 111 22 11   ",
]

raw_numbers_with_duplicate = [
   "(067)\\t123 4567",
   " 067 \\t123 4567",
   " + 067\\t123 4567",
   "    +38(050)123-32-34",
   "  +38050123-32-34",
   "    +38 050 123-32-34",
 ]

def sanitizing_numbers(phone_numbers):
    sanitized_numbers = []

    for number in phone_numbers:
       sanitized_number = re.sub(r'\D', '', number)
       if sanitized_number not in sanitized_numbers:
        sanitized_numbers.append(sanitized_number)

    return sanitized_numbers

def normolizing_numbers(phone_numbers):
    sanitized_numbers = sanitizing_numbers(phone_numbers)
    normalized = []

    for number in sanitized_numbers:
        if number.startswith('380'):
            normalized.append('+' + number)
        elif number.startswith('0'):
            normalized.append('+38' + number)
        else:
            normalized.append('+' + number)

    return normalized

clear_list = normolizing_numbers(raw_numbers)
clear_list_with_duplicate = normolizing_numbers(raw_numbers_with_duplicate)
print(clear_list)
print(clear_list_with_duplicate)

    







    